// 1. ექმენით სტუდენტის, მასწავლებლის და საგნის კლასები.
// a. ტუდენტის კლასში უნდა არსეობდეს ინფორმაცია სტუდენტის სახელი გვარი პირადი ნომერი (პირადი ნომერი არ უნდა აღემატებოდეს 11 ციფრს),
// საგნების ჩამონათვალს და სემესტრების შესახებ ინფორმაციას.(ეს ცალკე კლასად შეგიძლიათ აღწეროთ).
// ექმენით property რომელიც გამოტანს სახელს და გვარს ერთად.

// ტუდენტს არ უნდა შეეძოს 35 GPA ზე მეტის აღება.
// ექმენით მეთოდები რომელიც გამოიტანს სემესტრის ან სემესტრების საგნების ჩამონათვალს და ლექტორების შესახებ ინფორმაციას.
// ტუდენტ კლასს ასევე უნდა ჰქონდეს მეთოდები რომელიც დაამატებს სემესტრს და ამ სემესტრის საგნებს.
//  ნ კონკრეტულ სემესტრში დაამატებს საგანს.

// b. ასწავლებლის კლასი უნდა შეიცავდეს მასწავლების სახელს და გვარს და იმ საგნების სიას რომელსაც ასწავლის.
// რთ მასწავლებელს არ უნდა შეეძლოს 3 ზე მეტი საგნის სწავლება. ლასს განუსაზღვრეთ საგნის დამატების და შეცვლის მეთოდები.

// c. აგნის კლასი უნდა შეიცავდეს საგნის დასახელებას, წინაპირობებეს (იმ საგნებს რომელიც არის წინაპირობა ახალი საგნის ასარჩევად), 
// კრედიტის რაოდენობას და საგანზე მაქსიმალური სტუდენტების რაოდენობას.

// ადატვირთეთ ToString() მეთოდი , განსაზღვრეთ პარამეტრიანი და უპარამეტრო კონსტრუქტორები ყველა კლასისთვის.

using Quiz3Ex1.StudentInfo;
using Quiz3Ex1.TeacherInfo;
using Quiz3Ex1.SubjectInfo;
using Quiz3Ex1.PersonInfo;
using System;

List<string> FirstName = new List<string>();
List<string> LastName = new List<string>();
List<string> PersonalNumber = new List<string>();
List<string> SubjectMajor = new List<string>();
List<string> Term = new List<string>();

Student s = new Student("George", "Smith", "01010101010", "csharp", "3");
Teacher t = new Teacher("David", "Brown", "csharp");
Subject s1 = new Subject("csharp", "java", "75", "15");

