static void Main(string[] args)
{

}
// 1. ექმენით სტუდენტის, მასწავლებლის და საგნის კლასები.
// a. ტუდენტის კლასში უნდა არსეობდეს ინფორმაცია სტუდენტის სახელი გვარი პირადი ნომერი (პირადი ნომერი არ უნდა აღემატებოდეს 11 ციფრს),
// საგნების ჩამონათვალს და სემესტრების შესახებ ინფორმაციას.(ეს ცალკე კლასად შეგიძლიათ აღწეროთ).
// ექმენით property რომელიც გამოტანს სახელს და გვარს ერთად.

// ტუდენტს არ უნდა შეეძოს 35 GPA ზე მეტის აღება.
// ექმენით მეთოდები რომელიც გამოიტანს სემესტრის ან სემესტრების საგნების ჩამონათვალს და ლექტორების შესახებ ინფორმაციას.
// ტუდენტ კლასს ასევე უნდა ჰქონდეს მეთოდები რომელიც დაამატებს სემესტრს და ამ სემესტრის საგნებს.
//  ნ კონკრეტულ სემესტრში დაამატებს საგანს.

// b. ასწავლებლის კლასი უნდა შეიცავდეს მასწავლების სახელს და გვარს და იმ საგნების სიას რომელსაც ასწავლის.
// რთ მასწავლებელს არ უნდა შეეძლოს 3 ზე მეტი საგნის სწავლება. ლასს განუსაზღვრეთ საგნის დამატების და შეცვლის მეთოდები.

// c. აგნის კლასი უნდა შეიცავდეს საგნის დასახელებას, წინაპირობებეს (იმ საგნებს რომელიც არის წინაპირობა ახალი საგნის ასარჩევად), 
// კრედიტის რაოდენობას და საგანზე მაქსიმალური სტუდენტების რაოდენობას.

// ადატვირთეთ ToString() მეთოდი , განსაზღვრეთ პარამეტრიანი და უპარამეტრო კონსტრუქტორები ყველა კლასისთვის.

// 2. ექმენით Custom Queue- ჯენერიკ იმპლემენტიაცია განუსაზღვრეთ კონსტრუქტორი პარამეტრიანი და უპარამეტროც.
//  ნდა შეიძებოდეს ქიუს ზომის შემოწმება ცარიელია თუ არა. ნდა იყოს ელემენტის დამატების და წაშლის მეთოდები.
//  ანარჩენი მეთოდები შეგიძლიათ დაამატოთ სურვილისამებრ.

// 3. ემოდის გამოსახულება სტრინგის სახით. 
// დაწერეთ პროგრამა რომელიც ამ გამოსახულების შედეგს გამოთვლის (არითმეტიკული ოპერაციები ჩავთვალოთ რომ გვაქვს მხოლოდ + - * ) 
// მაგ: “((1+2)*(3+4))*(5*(8+9))”

// 4. ექმენით ინტერფეისი IShape რომელსაც ექნება ფართობის და პერიმეტრის გამოთვლის მეთოდები.
//  ექმენით პრიზმის, სამკუთხედის , მართკუთხედის, და ტრაპეციის კლასები.
// ელები დაამატეთ საჭიროებისამებრ. ააკეთეთ თითოეულ კლასში IShape-ის იმპლემენტაცია.